app/controllers/pages_controller.rb

  def hiscores
    @users=User.order("win DESC")
---
SELECT "users".* FROM "users" ORDER BY win DESC

  def played
    current_user.wins+=1 if params[:win]
    current_user.losses+=1 if params[:loss]
    current_user.ties+=1 if params[:tie]
    current_user.save
---
UPDATE "users" SET "updated_at" = ?, "losses" = ? WHERE "users"."id" = ?  [["updated_at", "2021-11-03 10:07:35.990057"], ["losses", 1], ["id", 2]]